AxDen-Dev/NRF52_Smart_ECG_PPG_example/main.c
	sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);

#endif

}

static void log_init(void) {
	ret_code_t err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
	ret_code_t err_code;
	err_code = nrf_pwr_mgmt_init();
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void) {
	if (NRF_LOG_PROCESS() == false) {
		nrf_pwr_mgmt_run();
	}
}

static void wait_200ms() {

	for (uint8_t i = 0; i < 2; i++) {

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

	}

}

static uint8_t update_Heartrate_SPO2() {

	uint8_t i2c_state = 0x01;

	uint16_t printCount = 0;

	uint32_t red = 0x00;
	uint32_t ir = 0x00;
	uint32_t green = 0x00;
	uint8_t ppgErrorCount = 0;

	app_timer_start(m_sensor_timer_id, MAX30101_APP_TIMER_DELAY, NULL);

	i2c_state = i2c_state & set_max30101_normal_mode();

	setHeartrateMinMax(40, 180);

	if (i2c_state) {

		for (uint32_t i = 0; i < 3000; i++) {

			get_max30101_ir_red_green(&ir, &red, &green);

			if (green > MAX30101_GREEN_PROXY_THR) {

				updateHeartateGreen(green);

				if (updateHeartateIR(ir, red) == 0x01) {

					updateSpo2RedIrAcc();

				}

				ppgErrorCount = 0;

			} else {

				ppgErrorCount++;

				if (ppgErrorCount > MAX30101_GREEN_PROXY_ERROR_COUNT) {

					initHeartrate();

					ppgErrorCount = 0;

				}

			}

			printCount++;

			if (printCount > 500) {

				getHeartrateValue(&ir_heart_rate, &ir_heart_rate_count,
						&green_heart_rate, &green_heart_rate_count);

				getSpo2Value(&spo2, &spo2_count);

				set_uart_usb_in_out_green_heartrate(green_heart_rate,
						green_heart_rate_count);

				set_uart_usb_in_out_ir_heartrate(ir_heart_rate,
						ir_heart_rate_count);

				set_uart_usb_in_out_spo2(spo2, spo2_count);

				printCount = 0;

			}

			while (!sensor_timer_update) {

				idle_state_handle();

			}

			sensor_timer_update = 0x00;

		}

	}

	initHeartrate();

	i2c_state = i2c_state & set_max30101_sleep_mode();

	app_timer_stop(m_sensor_timer_id);

	return i2c_state;

}

static void update_ECG() {

	uint16_t printCount = 0;

	app_timer_start(m_sensor_timer_id, MAX30003_APP_TIMER_DELAY, NULL);

	init_ecg_algorithm();

	for (uint32_t i = 0; i < 7500; i++) {

		int32_t sample = get_max30003_ecg_voltage_sample();

		sample = update_ecg_algorithm(sample);

		get_ecg_heartrate(&ecg_heart_rate, &ecg_heart_rate_count);

		printCount++;

		if (printCount > 1250) {

			set_uart_usb_in_out_ecg_heartrate(ecg_heart_rate,
					ecg_heart_rate_count);

			printCount = 0;

		}

		while (!sensor_timer_update) {

			idle_state_handle();

		}

		sensor_timer_update = 0x00;

	}

	app_timer_stop(m_sensor_timer_id);

}

static void get_mac_address() {

	uint32_t err_code;
	ble_gap_addr_t addr;

	err_code = sd_ble_gap_addr_get(&addr);
	APP_ERROR_CHECK(err_code);

	for (uint8_t i = 0; i < 6; i++) {

		mac_address[5 - i] = addr.addr[i];

	}

}

static void saadc_callback(nrf_drv_saadc_evt_t const *p_event) {

	if (p_event->type == NRF_DRV_SAADC_EVT_DONE) {

		ret_code_t err_code;

		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer,
		SAADC_SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);

		int32_t adc_0_value = p_event->data.done.p_buffer[0];

		float battery = (float) adc_0_value / 255;
		battery = battery * 3.6;
		battery *= 3.0;
		battery_value = (uint8_t) (battery * 10);

		nrf_drv_saadc_uninit();

		NRF_SAADC->INTENCLR = (SAADC_INTENCLR_END_Clear
				<< SAADC_INTENCLR_END_Pos);
		NVIC_ClearPendingIRQ(SAADC_IRQn);

		m_saadc_initialized = 0x00;

		NRF_LOG_INFO("BAT %d", battery_value);
		NRF_LOG_FLUSH();

	}

}

static void saadc_init(void) {

	ret_code_t err_code;
	nrf_drv_saadc_config_t saadc_config;
	nrf_saadc_channel_config_t channel_config0;

	saadc_config.resolution = NRF_SAADC_RESOLUTION_8BIT;
	saadc_config.oversample = NRF_SAADC_OVERSAMPLE_DISABLED;
	saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW;

	err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
	APP_ERROR_CHECK(err_code);

	channel_config0.reference = NRF_SAADC_REFERENCE_INTERNAL;
	channel_config0.gain = NRF_SAADC_GAIN1_6;
	channel_config0.acq_time = NRF_SAADC_ACQTIME_10US;
	channel_config0.mode = NRF_SAADC_MODE_SINGLE_ENDED;
	channel_config0.pin_p = NRF_SAADC_INPUT_AIN3;
	channel_config0.pin_n = NRF_SAADC_INPUT_DISABLED;
	channel_config0.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
	channel_config0.resistor_n = NRF_SAADC_RESISTOR_DISABLED;

	err_code = nrf_drv_saadc_channel_init(0, &channel_config0);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool_low_power[0],
	SAADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool_low_power[1],
	SAADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);

}

static void read_battery_level(void) {

	if (!m_saadc_initialized) {

		saadc_init();

	}

	m_saadc_initialized = 0x01;

	nrf_drv_saadc_sample();

	while (m_saadc_initialized) {

		idle_state_handle();

	}

	nrf_gpio_pin_clear(GPIO_BAT_EN);

}

static void twi_scan(void) {

	NRF_LOG_INFO("I2C Scan started.");

	for (uint16_t i = 0; i < 127; i++) {

		uint8_t reg = 0x01;
		uint8_t twi_timeout = 5;

		twi_write_done = 0x00;
		twi_read_done = 0x00;
		twi_address_nack = 0x00;

		nrf_drv_twi_tx(&m_twi, i, &reg, 1, false);

		while (!twi_write_done && --twi_timeout) {

			idle_state_handle();

		}

		if (!twi_address_nack) {

			set_uart_usb_in_out_find_i2c_address(i);

			NRF_LOG_INFO("FIND %02X", i);

