AxDen-Dev/NRF52_Smart_ECG_PPG_example/main.c
	uint8_t rev_id = get_max30003_rev_id();
	NRF_LOG_INFO("MAX30003 REV ID %02X", rev_id);
	NRF_LOG_FLUSH();

	init_max30003_mode_0();

	nrf_gpio_pin_set(GPIO_BAT_EN);

	wait_200ms();

	read_battery_level();

	NRF_LOG_INFO("Print sensor value");

	set_uart_usb_in_out_battery(battery_value);

	set_uart_usb_in_out_temperature(temperature);

	NRF_LOG_INFO("Start main loop");

	radio_packet_protocol.Packet.company_id[0] = COMPANY_ID >> 8;
	radio_packet_protocol.Packet.company_id[1] = COMPANY_ID;

	radio_packet_protocol.Packet.device_id[0] = DEVICE_TYPE >> 8;
	radio_packet_protocol.Packet.device_id[1] = DEVICE_TYPE;

	memcpy(radio_packet_protocol.Packet.mac_address, mac_address, 8);

	radio_packet_protocol.Packet.control_number = 0;

	for (;;) {

		if (!nrf_gpio_pin_read(GPIO_BTN)) {

			nrf_gpio_pin_toggle(GPIO_LED_0);

		}

		if (collection_cycle_update) {

			if (battery_read_step == 0x00) {

				nrf_gpio_pin_set(GPIO_BAT_EN);

				battery_read_step = 0x01;

			} else {

				read_battery_level();

				get_si7051_temperature(&temperature);

				nrf_gpio_pin_clear(GPIO_LED_1);

				update_ECG();

				update_Heartrate_SPO2();

				payload_size = 0;
				memset(payload, 0x00, sizeof(payload));

				payload_size = sprintf((char*) payload, "%d.%d,",
						(battery_value / 10), (battery_value % 10));

				payload_size += sprintf((char*) payload + payload_size,
						"%d.%d,", (temperature / 10), abs(temperature % 10));

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						green_heart_rate);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						green_heart_rate_count);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						ir_heart_rate);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						ir_heart_rate_count);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						spo2);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						spo2_count);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						ecg_heart_rate);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						ecg_heart_rate_count);

				radio_packet_protocol_size = PACKET_HEADER_SIZE;
				radio_packet_protocol_size += payload_size;
				memcpy(radio_packet_protocol.Packet.payload, payload,
						payload_size);

				radio_packet_protocol_size = PACKET_HEADER_SIZE;
				radio_packet_protocol_size += payload_size;
				memcpy(radio_packet_protocol.Packet.payload, payload,
						payload_size);

				battery_read_step = 0x00;

				collection_cycle_update = 0x00;

				if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

					adversting_stop();

					gap_params_init();

					advertising_init(data_update_state);

					advertising_start();

				}

				data_update_state = 0x01;

				NRF_LOG_INFO("Data Update");

			}

		}

		if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

			if (aggregator_notify_enable_state) {

				if (data_update_state) {

					if (tx_complete_state == 0x01) {

						tx_complete_state = 0x00;

						ble_service_send_aggregator_notification(m_conn_handle,
								&m_service, radio_packet_protocol.buffer,
								radio_packet_protocol_size);

						data_update_state = 0x00;

						NRF_LOG_INFO("Aggregator notify send");

					} else if (tx_complete_state == 0x02) {

						disconnect_timeout_count = DISCONNECT_TIMEOUT;

					}

				}

			} else if (stream_notify_enable_state) {

				if (data_update_state) {

					if (tx_complete_state) {

						tx_complete_state = 0x00;

						ble_service_send_stream_notification(m_conn_handle,
								&m_service, radio_packet_protocol.buffer,
								radio_packet_protocol_size);

						data_update_state = 0x00;

						NRF_LOG_INFO("Stream notify send");

					}

				}

				disconnect_timeout_count = 0;

			}

			disconnect_timeout_count++;

			if (disconnect_timeout_count > DISCONNECT_TIMEOUT) {

				if (request_disconnect == 0x00) {

					sd_ble_gap_disconnect(m_conn_handle,
					BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					request_disconnect = 0x01;

					NRF_LOG_INFO("Disconnect request");

				}

			}

		} else {

			disconnect_timeout_count = 0;

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		nrf_gpio_pin_toggle(GPIO_LED_1);

		NRF_LOG_FLUSH();

	}
}

/**
 * @}
 */
